---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.RevitServerException
source: html/00732c50-a7db-ee10-cadc-89921c8587ed.htm
---
# RevitServerException Members

Retrieves data needed to serialize the target object.